#+title: Características de una rutina de alta calidad

* No tienen efectos colaterales
- Un efecto colateral es una salida o efecto inesperado, comúnmente
  silencioso que se produce al invocar una rutina
- Al ser inesperado suele generar bugs
- Al ser silencioso suele ser difícil de corregir
- Es común que suceda cuando se manipulan referencias (osea memoria)
  de forma directa (no haciendo una copia de la estructura a manipular)
- Nunca usar variables globales
- En POO la manipulación de atributos puede introducir efectos
  colaterales
- Hay lenguajes donde los efectos colaterales se restringen al no permitir modificar variables (datos inmutables), ejemplo: Clojure, Haskell

  #+begin_src python :session *py* :results output :exports both :tangled /tmp/test.py
    def calcular_sumatoria(lista_numeros, valor):
        lista_numeros = lista_numeros[:] # copiar lista, evita el efecto colateral
        resultado = 0
        lista_numeros[0] += 1 
        for numero in lista_numeros:
            resultado += numero
        valor += 1
        return resultado + valor

    lista = [1, 2, 3, 4, 5]
    valor = 1
    print(calcular_sumatoria(lista, valor))
    print(lista)
    print(valor)
    print(calcular_sumatoria(lista, valor))
  #+end_src

  #+RESULTS:
  : 18
  : [1, 2, 3, 4, 5]
  : 1
  : 18


